<div class="alert alert-block alert-info">
<center>ESTATÍSTICA APLICADA</center>
<center>LISTA 6a</center>
<center>ALUNO: Matheus Carneiro da Cunha</center>
</div>

In [64]:
import pandas as pd
import numpy as np

<div class="alert alert-block alert-info">
Resposta da questão 1)
</div>

In [65]:
Mercearia = pd.DataFrame({"loja":["A", "A", "A"],
"dia": ["sex", "sab", "dom"],
"valor": [7500, 9500, 8200]})

Farmácia = pd.DataFrame({"loja":["B", "B", "B"],
"dia": ["sex", "sab", "dom"],
"valor": [5100, 8250, 9900]})

Restaurante = pd.DataFrame({"loja":["C", "C"],
"dia": ["sab", "dom"],
"valor": [7500, 11800]})

In [66]:
Mercearia

  loja  dia  valor
0    A  sex   7500
1    A  sab   9500
2    A  dom   8200

In [67]:
Farmácia

  loja  dia  valor
0    B  sex   5100
1    B  sab   8250
2    B  dom   9900

In [68]:
Restaurante

  loja  dia  valor
0    C  sab   7500
1    C  dom  11800

## DataFrame juntando por linha

In [69]:
df1 = pd.concat([Mercearia,Farmácia,Restaurante], ignore_index=True)
df1

  loja  dia  valor
0    A  sex   7500
1    A  sab   9500
2    A  dom   8200
3    B  sex   5100
4    B  sab   8250
5    B  dom   9900
6    C  sab   7500
7    C  dom  11800

## DataFrame juntando por coluna

In [70]:
df2 = pd.concat([Mercearia,Farmácia,Restaurante],axis=1)
df2

  loja  dia  valor loja  dia  valor loja  dia    valor
0    A  sex   7500    B  sex   5100    C  sab   7500.0
1    A  sab   9500    B  sab   8250    C  dom  11800.0
2    A  dom   8200    B  dom   9900  NaN  NaN      NaN

##  Diferenças entre as duas saídas

<div>
A criação dos dois dataframes usaram o	 método	 	concat()

<br>No primeiro,	os	DataFrames		Mercearia		(com	3	linhas),		Farmácia	(com	3	linhas)	e		Restaurante		(com	2	linhas)	foram	concatenados	para
um	único	DataFrame		df1		contendo	3	+	3	+	2	=	8	linhas.

<br>E no segundo juntando por colunas, o	resultado	da	concatenação df2, fez a loja C no dia da sexta	usar	 do	 valor	 	NaN		 para	 permitir	 o	 alinhamento	 dos	 dados.
</div>

<div class="alert alert-block alert-info">
Resposta da questão 2)
</div>

In [71]:
SQL = pd.DataFrame({"email":["rakesh@xyz.com",
"ecg@acmecorpus.com"]})

PYTHON = pd.DataFrame({"email":["ana@xyz.com",
"jonas@acmecorpus.com",
"rakesh@xyz.com"]})

In [72]:
SQL

                email
0      rakesh@xyz.com
1  ecg@acmecorpus.com

In [73]:
PYTHON

                  email
0           ana@xyz.com
1  jonas@acmecorpus.com
2        rakesh@xyz.com

## Alunos distintos

In [74]:
alunos=pd.concat([SQL,PYTHON],ignore_index=True)
alunos=alunos.drop_duplicates()
alunos

                  email
0        rakesh@xyz.com
1    ecg@acmecorpus.com
2           ana@xyz.com
3  jonas@acmecorpus.com

## Alunos que fizeram ambos os cursos

In [75]:
ambos = SQL.merge(PYTHON)
ambos

            email
0  rakesh@xyz.com

In [76]:
so_sql = SQL[SQL.email.isin(PYTHON.email)==False]
so_python = PYTHON[PYTHON.email.isin(SQL.email)==False]

## alunos que realizaram o curso de SQL, mas não o de PYTHON

In [77]:
so_sql

                email
1  ecg@acmecorpus.com

## alunos que realizaram o curso de PYTHON, mas não o de SQL

In [78]:
so_python

                  email
0           ana@xyz.com
1  jonas@acmecorpus.com

<div class="alert alert-block alert-info">
Resposta da questão 3)
</div>

In [79]:
dic_emp = {"id":["D1","D2","D3","D4"],
"nomDepto": ["Compras","RH","TI","Vendas"],
"local":["SP","RJ","RJ","SP"]}

dic_func = {"num":[3199,3269,3555,3788,3844],
"nome": ["Ana","David","José","Marina","Luís"],
"salario":[1600,2975,1500,5000,3000],
"idDepto": ["D2","D3",None,"D2","D4"]}

empresa = pd.DataFrame(dic_emp)
funcionarios = pd.DataFrame(dic_func)

## Combinação usando Merge( )

In [80]:
junção = pd.merge(empresa,funcionarios, left_on="id",right_on="idDepto")
junção

   id nomDepto local   num    nome  salario idDepto
0  D2       RH    RJ  3199     Ana     1600      D2
1  D2       RH    RJ  3788  Marina     5000      D2
2  D3       TI    RJ  3269   David     2975      D3
3  D4   Vendas    SP  3844    Luís     3000      D4